Revit 2023 API
GroupNode.GetSymbolId Method
 The Id of the symbol associated with the node. This property is deprecated in Revit 2023 and may be removed in a future version of Revit. For an InstanceNode please use the GetSymbolGeometryId().SymbolId. For a LinkNode please use SymbolId property. In Revit 2023 we introduced instance nodes that point to a part of the symbol's geometry. For comparing if two such nodes point to the same geometry, the SymbolId isn't enough. SymbolGeometryId can be used to identify a piece of geometry managed by a symbol element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute]
public ElementId GetSymbolId()
Visual Basic
<ObsoleteAttribute> _
Public Function GetSymbolId As ElementId
Visual C++
[ObsoleteAttribute]
public:
ElementId^ GetSymbolId()
See Also
GroupNode Class
Autodesk.Revit.DB Namespace